In [165]:
from datetime import datetime
import pandas as pd
import numpy as np

import importlib
from cryptoz import utils
importlib.reload(utils)

In [134]:
df = pd.DataFrame({'a': [0, 1, 2, 3, 4], 'b': [4, 3, 2, 1, 0], 'c': [0, -1, -2, -3, -4]}, index=[
    datetime(2018, 1, 1, 1, 1, 1),
    datetime(2018, 1, 1, 1, 1, 2),
    datetime(2018, 1, 1, 1, 1, 3),
    datetime(2018, 1, 1, 1, 2, 1),
    datetime(2018, 1, 1, 1, 2, 2)
])
df

                     a  b  c
2018-01-01 01:01:01  0  4  0
2018-01-01 01:01:02  1  3 -1
2018-01-01 01:01:03  2  2 -2
2018-01-01 01:02:01  3  1 -3
2018-01-01 01:02:02  4  0 -4

In [135]:
utils.select_window(df, pd.Timedelta(minutes=1))

                     a  b  c
2018-01-01 01:01:03  2  2 -2
2018-01-01 01:02:01  3  1 -3
2018-01-01 01:02:02  4  0 -4

In [136]:
utils.describe(df)

   count  mean       std  min  25%  50%  75%  max
a    5.0   2.0  1.581139  0.0  1.0  2.0  3.0  4.0
b    5.0   2.0  1.581139  0.0  1.0  2.0  3.0  4.0
c    5.0  -2.0  1.581139 -4.0 -3.0 -2.0 -1.0  0.0

## Windows

In [137]:
np.sum(df)

a    10
b    10
c   -10
dtype: int64

In [138]:
utils.apply(df, lambda x: x + np.sum(x))

                      a   b   c
2018-01-01 01:01:01  10  14 -10
2018-01-01 01:01:02  11  13 -11
2018-01-01 01:01:03  12  12 -12
2018-01-01 01:02:01  13  11 -13
2018-01-01 01:02:02  14  10 -14

In [139]:
utils.rolling_apply(df, lambda x: (x + np.sum(x))[-1], window=3)

                        a     b     c
2018-01-01 01:01:01   NaN   NaN   NaN
2018-01-01 01:01:02   NaN   NaN   NaN
2018-01-01 01:01:03   5.0  11.0  -5.0
2018-01-01 01:02:01   9.0   7.0  -9.0
2018-01-01 01:02:02  13.0   3.0 -13.0

In [140]:
utils.expanding_apply(df, lambda x: (x + np.sum(x))[-1])

                        a     b     c
2018-01-01 01:01:01   0.0   8.0   0.0
2018-01-01 01:01:02   2.0  10.0  -2.0
2018-01-01 01:01:03   5.0  11.0  -5.0
2018-01-01 01:02:01   9.0  11.0  -9.0
2018-01-01 01:02:02  14.0  10.0 -14.0

In [141]:
utils.resampling_apply(df, lambda x: x + np.sum(x), pd.Timedelta(minutes=1))

                      a   b   c
2018-01-01 01:01:01   3  13  -3
2018-01-01 01:01:02   4  12  -4
2018-01-01 01:01:03   5  11  -5
2018-01-01 01:02:01  10   2 -10
2018-01-01 01:02:02  11   1 -11

## Combinations

In [142]:
utils.product(df.columns)

[('a', 'a'),
 ('a', 'b'),
 ('a', 'c'),
 ('b', 'a'),
 ('b', 'b'),
 ('b', 'c'),
 ('c', 'a'),
 ('c', 'b'),
 ('c', 'c')]

In [143]:
utils.combine(df.columns)

[('a', 'b'), ('a', 'c'), ('b', 'c')]

In [144]:
utils.combine_rep(df.columns)

[('a', 'a'), ('a', 'b'), ('a', 'c'), ('b', 'b'), ('b', 'c'), ('c', 'c')]

In [145]:
utils.pairwise_apply(df, utils.combine_rep, lambda x, y: x + y)

                     a        b     c
                     a  b  c  b  c  c
2018-01-01 01:01:01  0  4  0  8  4  0
2018-01-01 01:01:02  2  4  0  6  2 -2
2018-01-01 01:01:03  4  4  0  4  0 -4
2018-01-01 01:02:01  6  4  0  2 -2 -6
2018-01-01 01:02:02  8  4  0  0 -4 -8

## Normalization

In [146]:
utils.normalize(df, 'minmax')

                        a     b     c
2018-01-01 01:01:01  0.00  1.00  1.00
2018-01-01 01:01:02  0.25  0.75  0.75
2018-01-01 01:01:03  0.50  0.50  0.50
2018-01-01 01:02:01  0.75  0.25  0.25
2018-01-01 01:02:02  1.00  0.00  0.00

In [147]:
utils.rolling_normalize(df, 'minmax', window=3)

                       a    b    c
2018-01-01 01:01:01  NaN  NaN  NaN
2018-01-01 01:01:02  NaN  NaN  NaN
2018-01-01 01:01:03  1.0  0.0  0.0
2018-01-01 01:02:01  1.0  0.0  0.0
2018-01-01 01:02:02  1.0  0.0  0.0

In [148]:
utils.expanding_normalize(df, 'minmax')

                       a    b    c
2018-01-01 01:01:01  NaN  NaN  NaN
2018-01-01 01:01:02  1.0  0.0  0.0
2018-01-01 01:01:03  1.0  0.0  0.0
2018-01-01 01:02:01  1.0  0.0  0.0
2018-01-01 01:02:02  1.0  0.0  0.0

## Rescaling

In [149]:
utils.rescale(df, [0, 1])
# Must be the same as minmax normalization

                        a     b     c
2018-01-01 01:01:01  0.00  1.00  1.00
2018-01-01 01:01:02  0.25  0.75  0.75
2018-01-01 01:01:03  0.50  0.50  0.50
2018-01-01 01:02:01  0.75  0.25  0.25
2018-01-01 01:02:02  1.00  0.00  0.00

In [150]:
utils.rescale(df, [0, 1], from_range=[0, 10])

                       a    b    c
2018-01-01 01:01:01  0.0  0.4  0.0
2018-01-01 01:01:02  0.1  0.3 -0.1
2018-01-01 01:01:03  0.2  0.2 -0.2
2018-01-01 01:02:01  0.3  0.1 -0.3
2018-01-01 01:02:02  0.4  0.0 -0.4

In [151]:
utils.rolling_rescale(df, [0, 1], window=3)

                       a    b    c
2018-01-01 01:01:01  NaN  NaN  NaN
2018-01-01 01:01:02  NaN  NaN  NaN
2018-01-01 01:01:03  1.0  0.0  0.0
2018-01-01 01:02:01  1.0  0.0  0.0
2018-01-01 01:02:02  1.0  0.0  0.0

In [152]:
utils.expanding_rescale(df, [0, 1])

                       a    b    c
2018-01-01 01:01:01  NaN  NaN  NaN
2018-01-01 01:01:02  1.0  0.0  0.0
2018-01-01 01:01:03  1.0  0.0  0.0
2018-01-01 01:02:01  1.0  0.0  0.0
2018-01-01 01:02:02  1.0  0.0  0.0

In [153]:
utils.rescale_dynamic_range(df, [df*0, df*0+10], [0, 1])

                       a    b    c
2018-01-01 01:01:01  0.0  0.4  0.0
2018-01-01 01:01:02  0.1  0.3 -0.1
2018-01-01 01:01:03  0.2  0.2 -0.2
2018-01-01 01:02:01  0.3  0.1 -0.3
2018-01-01 01:02:02  0.4  0.0 -0.4

In [154]:
utils.reverse_scale(df)

                     a  b  c
2018-01-01 01:01:01  4  0 -4
2018-01-01 01:01:02  3  1 -3
2018-01-01 01:01:03  2  2 -2
2018-01-01 01:02:01  1  3 -1
2018-01-01 01:02:02  0  4  0